{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Argyle",
    "1": "Check",
    "10": "Sequin",
    "11": "Solid",
    "12": "Stripe",
    "13": "Transparent",
    "2": "Colour blocking",
    "3": "Denim",
    "4": "Dot",
    "5": "Embroidery",
    "6": "Lace",
    "7": "Metallic",
    "8": "Patterns",
    "9": "Placement print"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Argyle": "0",
    "Check": "1",
    "Colour blocking": "2",
    "Denim": "3",
    "Dot": "4",
    "Embroidery": "5",
    "Lace": "6",
    "Metallic": "7",
    "Patterns": "8",
    "Placement print": "9",
    "Sequin": "10",
    "Solid": "11",
    "Stripe": "12",
    "Transparent": "13"
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.35.0"
}
