{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Skirt",
    "1": "Jacket",
    "10": "Cardigan",
    "11": "Jumpsuit",
    "12": "Sweater",
    "13": "Blazer",
    "2": "Dress",
    "3": "Tee",
    "4": "Sweatpants",
    "5": "Tank",
    "6": "Romper",
    "7": "Top",
    "8": "Shorts",
    "9": "Jeans"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Blazer": "13",
    "Cardigan": "10",
    "Dress": "2",
    "Jacket": "1",
    "Jeans": "9",
    "Jumpsuit": "11",
    "Romper": "6",
    "Shorts": "8",
    "Skirt": "0",
    "Sweater": "12",
    "Sweatpants": "4",
    "Tank": "5",
    "Tee": "3",
    "Top": "7"
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "qkv_bias": true,
  "transformers_version": "4.29.1"
}
